{
  "meta": {
    "title": "Lorecraft Tutorial",
    "subtitle": "The World That Notices"
  },
  "start": "S01",
  "scenes": {
    "S01": {
      "text": "Moonlight breaks on shattered stone. The ruin’s entrance yawns like a cracked jaw, its archway half-swallowed by ivy and time.\n\nYou didn’t come here for glory. You came because the local road has gone quiet—and because something in the dark has started paying attention.\n\nA wind sighs from within, carrying cold air and the faint smell of old metal.",
      "options": [
        {
          "label": "Step into the ruin",
          "next": null
        },
        {
          "label": "Circle the entrance and scout for danger",
          "next": null
        }
      ]
    },
    "S02": {
      "text": "You cross the threshold.\n\nDust puffs under your boots. A corridor stretches forward—collapsed in places, but passable. Your candle’s flame steadies in the stale air, illuminating carvings worn smooth by centuries.\n\nSomewhere deeper, water drips… then stops, as if something listened.",
      "options": [
        {
          "label": "Take the corridor straight ahead",
          "next": null
        },
        {
          "label": "Move slowly—watch the floor for traps",
          "next": null
        }
      ]
    },
    "S03": {
      "text": "You circle the archway. The stone here is newer—repairs made long after the ruin fell. Whoever patched it up didn’t do it to keep people out.\n\nYou find scuffed footprints in the dirt. Fresh. Not yours.\n\nA tightness creeps into your chest. You’re being sloppy if you pretend you’re alone.",
      "options": [
        {
          "label": "Enter the ruin with your guard up",
          "next": null
        },
        {
          "label": "Follow the footprints into a side gap in the stone",
          "next": null
        }
      ]
    },
    "S04": {
      "text": "The corridor narrows. Your candlelight catches a thin wire—too late.\n\nA stone plate snaps under your weight. A dart hisses from the wall and bites your shoulder.\n\nPain blooms hot, then cold.",
      "options": [
        {
          "label": "Rip the dart free and keep moving",
          "next": null
        },
        {
          "label": "Stop and apply a bandage",
          "next": null
        }
      ]
    },
    "S05": {
      "text": "You advance with your weight on your back foot, eyes tracking the seams between stones.\n\nA wire gleams faintly—trap. You step over it carefully.\n\nThe ruin feels… aware. Like the air itself is waiting to see what you’ll do next.",
      "options": [
        {
          "label": "Continue deeper",
          "next": null
        },
        {
          "label": "Follow a side door marked with a faded sigil",
          "next": null
        }
      ]
    },
    "S06": {
      "text": "You slip through a gap where the wall has crumbled. The air smells of damp stone and old rot.\n\nA small cache lies hidden beneath a loose slab—someone’s emergency stash.\n\nInside: a wrapped packet of herbs (useful), and a battered buckler that still holds its shape.",
      "options": [
        {
          "label": "Take the herbs and buckler",
          "next": null
        },
        {
          "label": "Leave it—move quietly back toward the entrance",
          "next": null
        }
      ]
    },
    "S07": {
      "text": "You push on. The corridor opens into a fractured hall—pillars broken, mosaics smashed, and a dark pool at the center like spilled ink.\n\nYour candlelight doesn’t reach the far corners.\n\nThen you hear it: a slow scrape of something heavy dragged across stone.",
      "options": [
        {
          "label": "Hide behind a broken pillar",
          "next": null
        },
        {
          "label": "Approach the sound with weapon ready",
          "next": null
        },
        {
          "label": "Back away toward the corridor and reassess",
          "next": null
        }
      ]
    },
    "S08": {
      "text": "You press cloth and pressure to the wound. Your breath steadies.\n\nThe pain dulls to a warning. Not gone—just managed.\n\nYou move again, a little wiser about where you place your feet.",
      "options": [
        {
          "label": "Continue into the hall",
          "next": null
        }
      ]
    },
    "S09": {
      "text": "The side door groans as you pull it open.\n\nInside is a narrow chapel—collapsed roof, shattered altar, and a single iron reliquary still intact.\n\nSomething about it makes your candle flame lean toward it.",
      "options": [
        {
          "label": "Raise your candle and examine the reliquary",
          "next": null
        },
        {
          "label": "Leave the chapel before something notices you",
          "next": null
        }
      ]
    },
    "S10": {
      "text": "You tuck yourself behind a pillar, still as stone.\n\nA shape slides into view: a cave-wight—thin limbs, wet-looking skin, eyes like pale coins.\n\nIt sniffs the air. Your pulse thunders in your ears.",
      "options": [
        {
          "label": "Hold your breath and wait for it to pass",
          "next": null
        },
        {
          "label": "Strike while it’s searching",
          "next": null
        }
      ]
    },
    "S11": {
      "text": "You step forward. The wight turns.\n\nIt moves faster than it looks like it should—skittering, claws clicking.\n\nInstinct pulls you to your dagger.\n\nThis fight is not meant to be fair. It’s meant to teach you consequences.",
      "options": [
        {
          "label": "Slash with your Rusty Dagger",
          "next": null
        },
        {
          "label": "Try to shove it back and run",
          "next": null
        }
      ]
    },
    "S12": {
      "text": "You retreat to the corridor mouth. The hall stays quiet for a heartbeat…\n\nThen something breathes—wet and patient—just beyond the candle’s reach.\n\nYou can feel the ruin paying attention now. Like it’s weighing you.",
      "options": [
        {
          "label": "Return to the hall and face whatever is there",
          "next": null
        },
        {
          "label": "Take the side door you ignored earlier",
          "next": null
        }
      ]
    },
    "S13": {
      "text": "You lift the candle. The flame brightens—unnaturally steady.\n\nThe reliquary’s latch clicks on its own.\n\nInside rests a small charm etched with looping runes: a Warden Sigil.\n\nIt’s not powerful. It’s a promise. Something that says: you were here, and the ruin knows it.",
      "options": [
        {
          "label": "Take the Warden Sigil",
          "next": null
        },
        {
          "label": "Close the reliquary and back away",
          "next": null
        }
      ]
    },
    "S14": {
      "text": "The wight’s head tilts. For a terrifying moment, you’re sure it can hear you.\n\nThen it crawls away toward the dark pool.\n\nYou exhale slowly.\n\nA clever survivor doesn’t win fights. They avoid them.",
      "options": [
        {
          "label": "Slip toward the chapel door",
          "next": null
        },
        {
          "label": "Follow the wight at a distance",
          "next": null
        }
      ]
    },
    "S15": {
      "text": "Steel bites.\n\nYour dagger catches the wight across the ribs. It shrieks—an awful, thin sound.\n\nBut it rakes your arm as it recoils. Pain lances bright.\n\nYou can win this, but it will cost you.",
      "options": [
        {
          "label": "Press the attack",
          "next": null
        },
        {
          "label": "Fall back and use the environment",
          "next": null
        }
      ]
    },
    "S16": {
      "text": "You shove the creature, but it clings like a burr. It drags claws along your side as you bolt.\n\nYour breath tears in your chest.\n\nYou don’t have far before you’ll be cornered.",
      "options": [
        {
          "label": "Sprint toward the chapel door",
          "next": null
        },
        {
          "label": "Run for the exit and abandon the ruin",
          "next": null
        }
      ]
    },
    "S17": {
      "text": "The sigil warms in your palm. Not heat—recognition.\n\nA whisper slides through the ruin like a page turning:\n\nYou are seen.\n\nYou return to the hall with a steadier spine.",
      "options": [
        {
          "label": "Return to the shattered hall",
          "next": null
        },
        {
          "label": "Equip the Warden Sigil and feel it settle into place",
          "next": null
        }
      ]
    },
    "S18": {
      "text": "You shadow the wight to the dark pool. The water isn’t water.\n\nIt’s a mirror of the ceiling that isn’t there.\n\nThe creature leans over it, trembling.\n\nSomething stirs beneath the surface—something that feels older than stone.",
      "options": [
        {
          "label": "Throw a pebble into the pool",
          "next": null
        },
        {
          "label": "Back away quietly and take the chapel route",
          "next": null
        }
      ]
    },
    "S19": {
      "text": "You strike again, and again.\n\nThe wight collapses in a twitching heap.\n\nSilence follows—heavy, judgmental.\n\nYou wipe your blade on a torn banner and notice something gleaming in the creature’s nest: a small vial stoppered in wax.",
      "options": [
        {
          "label": "Take the vial",
          "next": null
        },
        {
          "label": "Don’t linger—leave before something bigger arrives",
          "next": null
        }
      ]
    },
    "S20": {
      "text": "You kick loose rubble into the wight’s path.\n\nIt trips, snarling.\n\nYou use the moment to retreat, putting stone between you and teeth.\n\nIt doesn’t pursue.\n\nNot because it can’t.\n\nBecause something else wants you deeper.",
      "options": [
        {
          "label": "Take the chapel route",
          "next": null
        },
        {
          "label": "Follow the hall’s far passage into darkness",
          "next": null
        }
      ]
    },
    "S21": {
      "text": "You focus on the sigil’s weight—how it seems to anchor you.\n\nYour candle flame steadies. The ruin feels less hostile.\n\nNot friendly.\n\nJust… interested.",
      "options": [
        {
          "label": "Proceed to the hall’s far passage",
          "next": null
        }
      ]
    },
    "S22": {
      "text": "The pebble hits the surface.\n\nThe pool doesn’t ripple.\n\nIt opens.\n\nA hand—too long, too pale—reaches up and grips the edge.\n\nThis is your warning: some choices carry consequences you cannot outfight.",
      "options": [
        {
          "label": "Run. Now.",
          "next": null
        },
        {
          "label": "Lean closer and look into the pool",
          "next": null
        }
      ]
    },
    "S23": {
      "text": "The vial’s contents glow faintly—like captured dawn.\n\nIt feels valuable. Useful.\n\nBut you feel a prickle at the back of your neck.\n\nSomething noticed the fight.",
      "options": [
        {
          "label": "Pocket the vial and move on",
          "next": null
        }
      ]
    },
    "S24": {
      "text": "You find a stairwell spiraling down.\n\nThe air grows colder with each step. Your candle throws long shadows that don’t always match your movement.\n\nAt the bottom: a sealed door of black stone, carved with the same looping runes as the sigil.\n\nThere is no handle.\n\nOnly a shallow indentation—like it expects a token.\n\nThe ruin is asking a question.",
      "options": [
        {
          "label": "Press the Warden Sigil to the indentation",
          "next": null
        },
        {
          "label": "Hold your candle to the runes and wait",
          "next": null
        },
        {
          "label": "Force the door open with brute strength",
          "next": null
        }
      ]
    },
    "S25": {
      "text": "You lean closer.\n\nThe pool is not a pool.\n\nIt’s a mouth.\n\nCold wraps your face. Fingers hook behind your jaw.\n\nFor one heartbeat, you understand: curiosity is not wisdom. Sometimes it’s just hunger wearing a better mask.",
      "options": [
        {
          "label": "Try to wrench free",
          "next": null
        },
        {
          "label": "Give in to the pull",
          "next": null
        }
      ]
    },
    "S26": {
      "text": "You drive your shoulder into the stone.\n\nIt doesn’t budge.\n\nAgain.\n\nThe impact rattles your bones. Your vision flashes white.\n\nWhen the door finally shifts, it’s not because you won.\n\nIt’s because something on the other side let you.\n\nA breath—ancient and pleased—slides across your face.",
      "options": [
        {
          "label": "Step through anyway",
          "next": null
        },
        {
          "label": "Stagger back and flee while you still can",
          "next": null
        }
      ]
    },
    "S27": {
      "text": "You tear away, skin burning with cold.\n\nYour candle sputters—then steadies.\n\nThe pool’s surface becomes still again.\n\nBut you’ve been marked by whatever lives beneath.\n\nYou don’t know what that means yet.\n\nYou only know it noticed you back.",
      "options": [
        {
          "label": "Retreat to the stairwell and reassess",
          "next": null
        },
        {
          "label": "Leave the ruin before it can try again",
          "next": null
        }
      ]
    },
    "GOOD_END": {
      "text": "The Warden Sigil fits the indentation like it was made for your hand.\n\nThe black stone door sighs open.\n\nInside is not treasure.\n\nIt’s a chamber lined with names—hundreds of them—carved into the walls.\n\nYou add yours with a trembling fingertip.\n\nThe ruin accepts you.\n\nFor now.\n\nYou exit the dungeon alive, carrying proof that the world responds to those who dare to touch it.",
      "options": [
        {
          "label": "Return To Main Menu",
          "next": null
        }
      ]
    },
    "BAD_END": {
      "text": "You leave the ruin with your heart hammering and your hands shaking.\n\nThe night air feels too loud. Too exposed.\n\nYou didn’t solve the road’s silence.\n\nYou didn’t learn what waits beneath the stone.\n\nBut you lived.\n\nSometimes that’s the only victory you can afford.\n\nAnd sometimes… survival is just postponing the question.",
      "options": [
        {
          "label": "Return To Main Menu",
          "next": null
        }
      ]
    },
    "SPECIAL_END": {
      "text": "You lift the candle to the runes.\n\nThe flame elongates—thin and vertical—like a blade of light.\n\nFor a moment, the black stone becomes translucent.\n\nYou see the ruin’s memory: builders laying the first stone, wardens swearing oaths, a door sealed in fear and hope.\n\nThen the vision fades.\n\nThe door remains shut.\n\nBut something inside has seen you—and decided you’re not a stranger anymore.\n\nYou step away with knowledge instead of loot.\n\nIn Lorecraft, that can be worth more than gold.",
      "options": [
        {
          "label": "Return To Main Menu",
          "next": null
        }
      ]
    },
    "DEATH": {
      "text": "Your strength gives out.\n\nThe ruin doesn’t rage. It doesn’t gloat.\n\nIt simply waits, the way stone waits.\n\nThis is the tutorial’s rule: when your resource hits zero, the run ends.\n\nTry again. Learn the danger. Use your items when it matters.\n\nThe world that notices is not cruel.\n\nIt’s just real.",
      "options": [
        {
          "label": "Return To Main Menu",
          "next": null
        }
      ]
    }
  },
  "packId": "world_of_lorecraft",
  "blurb": "A first run into a ruin that watches you back. Learn VerseCraft’s rules through choices, consequences, and loot—survive long enough to discover what the world remembers.",
  "assets": {
    "cover": "content/packs/starter/covers/world-of-lorecraft.png"
  }
}